mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
/* $Id: main.c,v 1.36 2019/03/12 19:24:19 bouyer Exp $ */
/*
 * Copyright (c) 2023 Manuel Bouyer
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
 * TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
 * BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#include <xc.h>
#include <stdio.h> 
#include <string.h> 
#include <stdlib.h> 
#include <nmea2000.h>
#include <nmea2000_pgn.h>
#include <raddeg.h>
#include "serial.h"
#include "i2c.h"
#include "ntc_tab.h"
#include "pac195x.h"
#include "font5x8.h"
#include "font10x16.h"
#include "icons16x16.h"

typedef unsigned char u_char;
typedef unsigned int  u_int;
typedef unsigned long u_long;

static u_char default_src;

u_int devid, revid; 

u_long nmea2000_user_id; 

static u_char sid;

static struct nmea2000_msg msg;
static u_char nmea2000_data[NMEA2000_DATA_FASTLENGTH];

u_int timer0_read(void);

#define TIMER0_1MS    10
#define TIMER0_5MS    49
#define TIMER0_20MS   195
#define TIMER0_100MS  977

#define NCANOK  PORTCbits.RC2

#define PWM_OFF   LATCbits.LATC1
#define PWM_OK    PORTCbits.RC0
#define PWM_MID   LATCbits.LATC5 /* high-side resistor for 3-state PWM output */
#define PWM_OUT   LATCbits.LATC6 /* PWM output */
#define PAC_NDOWN LATCbits.LATC7

#define OLED_RSTN LATAbits.LATA4

static void
batt1_en(char on)
{
	CLCSELECT = 2;
	CLCnPOLbits.G2POL = on;
}

static void
batt2_en(char on)
{
	CLCSELECT = 3;
	CLCnPOLbits.G2POL = on;
}

static char counter_10hz;
static char counter_1hz;
static uint16_t seconds;
static volatile union softintrs {
	struct softintrs_bits {
		char int_10hz : 1;	/* 0.1s timer */
		char int_btn_down : 1;	/* button release->press */
		char int_btn_up : 1;	/* button press->release */
		char int_adcc : 1;	/* A/D convertion complete */
		char int_pacavg : 1;	/* pac average values updated */
		char int_pacacc : 1;	/* pac accum values updated */
	} bits;
	char byte;
} softintrs;

static uint16_t ad_pwm;
static uint16_t ad_solar;
static uint16_t ad_temp;

static uint16_t board_temp;

static enum {
	BTN_IDLE = 0,
	BTN_DOWN,
	BTN_DOWN_1,
	BTN_DOWN_1_P,
	BTN_DOWN_2,
	BTN_DOWN_2_P,
	BTN_UP
} btn_state;

/*
 * PWM fsm:
 * DOWN: everything off (PWM_OFF = 1, PWM_MID = PWM_OUT = 0), wait for power
	 up order
 * TURNON: PWM_OFF = 1, PWM_MID = PWM_OUT = 0
 * ON: PWM_OFF = 0, waiting for PWM_OK
 * OK: PWM_OK asserted, turn on PWM_MID, set up PWM registers and 
 *     connect PWM_OUT to PWM
 * IDLE: hardware ready, waiting for PWM values
 * RUNNING: providing PWM signal
 * GOIDLE: prepare for off: PWM_OUT = 0
 * BATTOFF: prepare for off: BATT1_OFF, bATT2_OFF
 * DISCHARGE: prepare for off: PWM_OUT = 0, PWM_MID = 0,
 */
static enum {
	PWMF_DOWN = 0,
	PWMF_TURNON,
	PWMF_ON,
	PWMF_OK,
	PWMF_IDLE,
	PWMF_RUNNING,
	PWMF_GOIDLE,
	PWMF_BATTOFF,
	PWMF_DISCHARGE,
} pwm_fsm;

static volatile union pwm_events {
	struct pwm_evtbits {
		char goon : 1;	/* turn PWM on */
		char gooff : 1; /* turn PWM off */
	} bits;
	char byte;
} pwm_events;

uint16_t pwm_time;

static inline void
pwm_runfsm()
{
	switch(pwm_fsm) {
	case PWMF_DOWN:
		PWM_OFF = 1;
		PWM_MID = 0;
		PWM_OUT = 0;
		if (pwm_events.bits.goon) {
			pwm_events.bits.goon = 0;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_TURNON;
		}
		break;
	case PWMF_TURNON:
		if ((timer0_read() - pwm_time) > TIMER0_5MS) {
			PWM_OFF = 0;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_ON;
		}
		break;
	case PWMF_ON:
		if (PWM_OK) {
			pwm_fsm = PWMF_OK;
		}
		if ((timer0_read() - pwm_time) > TIMER0_100MS) {
			/* timeout, retry */
			PWM_OFF = 1;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_TURNON;
		}
		break;
	case PWMF_OK:
		PWM_MID = 1;
		PWM1PR = 512; /* pwm at 125Khz */
		PWM1S1P1 = 0; /* default to off */
		PWM1CONbits.EN = 1;
		pwm_fsm = PWMF_IDLE;
		break;
	case PWMF_IDLE:
		if (pwm_events.bits.gooff) {
			pwm_events.bits.gooff = 0;
			PWM1CONbits.EN = 0;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_GOIDLE;
		}
		break;
	case PWMF_RUNNING:
		if (pwm_events.bits.gooff) {
			pwm_events.bits.gooff = 0;
			PWM1CONbits.EN = 0;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_GOIDLE;
		}
		break;
	case PWMF_GOIDLE:
		if ((timer0_read() - pwm_time) > TIMER0_20MS) {
			batt1_en(0);
			batt2_en(0);
			pwm_time = timer0_read();
			pwm_fsm = PWMF_BATTOFF;
		}
		break;
	case PWMF_BATTOFF:
		if ((timer0_read() - pwm_time) > TIMER0_5MS) {
			PWM_MID = 0;
			pwm_time = timer0_read();
			pwm_fsm = PWMF_DISCHARGE;
		}
		break;
	case PWMF_DISCHARGE:
		if ((timer0_read() - pwm_time) > TIMER0_20MS) {
			PWM_OFF = 1;
			pwm_fsm = PWMF_DOWN;
		}
		break;
	}
}

#define PAC_I2C_ADDR 0x2e

static volatile i2c_return_t i2c_return;

uint16_t batt_v[4];
int16_t batt_i[4];

static uint32_t voltages_acc[4];
pac_ctrl_t pac_ctrl;

/* for journal */
static int64_t l600_current_acc[4];
static __uint24 l600_current_count;
static uint32_t l600_voltages_acc[4];

/* PAC 195x state machine */

static struct pac_i2c_io {
	enum {
		PAC_FREE = 0,
		PAC_WRITE, /* general register write */
		PAC_READ, /* general register read */
		PAC_READ_ACCUM, /* read accumulator values */
		PAC_READ_AVG, /* read recent average values */
	} pac_type;
	u_char pac_reg; /* register address */
	void *pac_data; /* pointer to data for read/write */
	u_char pac_datalen;
} pac_i2c_io;

#define PAC_WRITEREG(reg, data) {\
	pac_i2c_io.pac_type = PAC_WRITE;\
	pac_i2c_io.pac_reg = (reg);\
	pac_i2c_io.pac_data = &(data);\
	pac_i2c_io.pac_datalen = sizeof(data);\
	pac_i2c_state = PAC_I2C_WAIT;\
	}

#define PAC_READREG(reg, data) {\
	pac_i2c_io.pac_type = PAC_READ;\
	pac_i2c_io.pac_reg = (reg);\
	pac_i2c_io.pac_data = &(data);\
	pac_i2c_io.pac_datalen = sizeof(data);\
	pac_i2c_state = PAC_I2C_WAIT;\
	}

#define PAC_WRITECMD(reg) {\
	pac_i2c_io.pac_type = PAC_WRITE;\
	pac_i2c_io.pac_reg = (reg);\
	pac_i2c_io.pac_data = NULL;\
	pac_i2c_io.pac_datalen = 0;\
	pac_i2c_state = PAC_I2C_WAIT;\
	}

