mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
/*
 * buffer to read accumulator count and all channel accumulators at once
 * as we're using readreg_be, the register order is inverted
 */
static struct { 
	u_char accum[3*7]; 
	pac_acccnt_t acc_count;
} _read_accum;

/*
 * buffer to read voltage/current values at once 
 * as we're using readreg_be, the register order is inverted
 * Disabled channels are skipped, so only 3 entries
 */
static struct {
	int16_t batt_i[3];
	uint16_t batt_v[3];
} _read_voltcur;

static enum {
	PAC_I2C_IDLE,
	PAC_I2C_ERROR, /* got error */
	PAC_I2C_COMPLETE, /* transaction complete */
	PAC_I2C_WAIT, /* waiting for i2c bus */
	PAC_I2C_WRITE,/* sending data */
	PAC_I2C_READ, /* reading data */
} pac_i2c_state;

static void
pac_i2c_exec(void)
{
	switch(pac_i2c_state) {
	case PAC_I2C_IDLE:
	case PAC_I2C_COMPLETE:
	case PAC_I2C_ERROR:
		return;
	case PAC_I2C_WAIT:
		switch(pac_i2c_io.pac_type) {
		case PAC_WRITE:
			i2c_writereg_be(PAC_I2C_ADDR, pac_i2c_io.pac_reg,
			    pac_i2c_io.pac_data, pac_i2c_io.pac_datalen,
			    &i2c_return);
			pac_i2c_state = PAC_I2C_WRITE;
			return;
		case PAC_READ:
			i2c_readreg_be(PAC_I2C_ADDR, pac_i2c_io.pac_reg,
			    pac_i2c_io.pac_data, pac_i2c_io.pac_datalen,
			    &i2c_return);
			pac_i2c_state = PAC_I2C_READ;
			return;
		case PAC_READ_ACCUM:
			i2c_readreg_be(PAC_I2C_ADDR, PAC_ACCCNT,
			    (void *)&_read_accum, sizeof(_read_accum), &i2c_return);
			pac_i2c_state = PAC_I2C_READ;
			return;
		case PAC_READ_AVG:
			i2c_readreg_be(PAC_I2C_ADDR, PAC_VBUS1_AVG,
			    (void *)&_read_voltcur, sizeof(_read_voltcur), &i2c_return);
			pac_i2c_state = PAC_I2C_READ;
			return;
		default:
			printf("pac_i2c_exec PAC_I2C_WAIT bad type %d\n",
			    pac_i2c_io.pac_type);
		}
		return;
	case PAC_I2C_WRITE:
	case PAC_I2C_READ:
		switch(i2c_return) {
		case I2C_INPROGRESS:
			return;
		case I2C_COMPLETE:
			pac_i2c_state = PAC_I2C_COMPLETE;
			return;
		case I2C_ERROR:
			/* XXX */
			printf("pac command %d %d fail\n", 
			    pac_i2c_io.pac_type, pac_i2c_io.pac_reg);
			pac_i2c_state = PAC_I2C_ERROR;
			return;
		}
	}
}

static char
pac_i2c_flush(void)
{
	while (pac_i2c_state != PAC_I2C_IDLE) {
		pac_i2c_exec();
		if (pac_i2c_state == PAC_I2C_ERROR) {
			printf("pac_i2c_flush: error %d state %d io_state %d\n",
			    i2c_return, pac_i2c_state, pac_i2c_io.pac_type);
			return 0;
		}
		if (pac_i2c_state == PAC_I2C_COMPLETE)
			pac_i2c_state = PAC_I2C_IDLE;
		i2c_wait(&i2c_return); /* will deal with timeout */
	}
	pac_i2c_io.pac_type = PAC_FREE;
	return 1;
}

/*
 * journal data structure (record every 10mn)
 * For current, in mA: 18 bits, including sign
 * voltage, max 20.47V needs 11 bits
 * temperature -40C to 60C: 8 bits (K - 233)
 * valid: 1bit
 * instance: 2 bits
 =>  total 40 bits, or 5 bytes
 51 entries per block of 256 bytes: 1 bytes free (for block flags)
 In 32k flash, 128 blocks -> 6528 entries, or 272 hours (11 days)
   with 4 channels active
 */

union log_entry {
	uint8_t data[5];
	struct {
		uint8_t temp;
		uint8_t u_low; /* low bits of voltage */
		uint16_t i_low; /* low bits current */
		uint8_t u_high : 3; /* high bits of voltage */
		uint8_t nvalid : 1; /* 0 = entry valid */
		uint8_t i_high: 2; /* high bits of current */
		uint8_t instance: 2; /* batt instance */
	} s;
};

#define LOG_ENTRIES 51

struct log_block {
	union log_entry b_entry[LOG_ENTRIES];
	uint8_t b_flags;
#define B_FILL_STAT 0x03
#define B_FILL_FREE 0x03
#define B_FILL_PART 0x01
#define B_FILL_FULL 0x00
#define B_FILL_GEN  0xfc
};

#define LOG_BLOCKS ((uint8_t)128)
#define LOG_BLOCKS_MASK (LOG_BLOCKS - 1)

extern const struct log_block battlog[LOG_BLOCKS] __at(0x18000);

extern struct log_block curlog __at(0x3700);

/* current log entry (to be updated) */
uint8_t log_cblk;
uint8_t log_centry;
uint8_t log_gen;

/* log requests/replies */
uint8_t logreq_len;
uint8_t logreq_id; /* current id for fast frame */

union __packed {
	uint8_t _data[233 + 8];
	struct private_log_request rq;
	struct private_log_reply rp;
	struct private_log_error er;
	struct private_log_reset rst;
} private_log_cmd;
static u_char fastid;

static inline void
utolog(uint16_t u, union log_entry *e)
{
	e->s.u_low = u & 0xff;
	e->s.u_high = (u >> 8) & 0x7;
}

static inline uint16_t
logtou(union log_entry *e)
{
	uint16_t u;

	u = e->s.u_low;
	u |= (uint16_t)(e->s.u_high & 0x7) << 8;
	return u;
}

static inline void
itolog(int64_t i, union log_entry *e)
{
	e->s.i_low = i & 0xffff;
	e->s.i_high = (i >> 16) & 0x3;
}

static inline int32_t
logtoi(union log_entry *e)
{
	int32_t i;
	i = e->s.i_low;
	i |= (uint32_t)(e->s.i_high & 0x3) << 16;
	if (e->s.i_high & 0x2) {
		i |= 0xfffe0000;
	}
	return i;
}

static void
page_erase(const void *p)
{
	uint8_t err = 0;
	__uint24 addr = (__uint24)p;

	printf("erase 0x%lx\n", (uint32_t)addr);

	NVMADR = addr;
	NVMCON1bits.CMD = 0x06;
	INTCON0bits.GIE = 0;

	NVMLOCK = 0x55;
	NVMLOCK = 0xAA;
	NVMCON0bits.GO = 1;

	while (NVMCON0bits.GO)
		; /* wait */

	if (NVMCON1bits.WRERR) {
		err++;
	}
	NVMCON1bits.CMD = 0;
	INTCON0bits.GIE = 1;
	if (err) {
		printf("erase 0x%lx failed\n", (uint32_t)addr);
	}
}

static void
page_read(const void *p)
{
	uint8_t err = 0;
	__uint24 addr = (__uint24)p;

	printf("read 0x%lx\n", (uint32_t)addr);

	NVMADR = addr;
	NVMCON1bits.CMD = 0x02;
	NVMCON0bits.GO = 1;

	while (NVMCON0bits.GO)
		; /* wait */

	NVMCON1bits.CMD = 0;
}

static void
page_write(const void *p)
{
	uint8_t err = 0;
	__uint24 addr = (__uint24)p;

	printf("write 0x%lx\n", (uint32_t)addr);

	NVMADR = addr;
	NVMCON1bits.CMD = 0x05;
	INTCON0bits.GIE = 0;

	NVMLOCK = 0x55;
	NVMLOCK = 0xAA;
	NVMCON0bits.GO = 1;

	while (NVMCON0bits.GO)
		; /* wait */

	if (NVMCON1bits.WRERR) {
		err++;
	}
	NVMCON1bits.CMD = 0;
	INTCON0bits.GIE = 1;
	if (err) {
		printf("write 0x%lx failed\n", (uint32_t)addr);
	}
}

static void
next_log_entry(void)
{
	printf("write log entry %d/%d\n", log_cblk, log_centry);
	/* mark entry as valid */
	curlog.b_entry[log_centry].s.nvalid = 0;
	curlog.b_flags = log_gen | B_FILL_PART;
	log_centry++;
	if (log_centry == LOG_ENTRIES) {
		/* next block */
		/* write current block */
		curlog.b_flags = log_gen | B_FILL_FULL;
		page_write(&battlog[log_cblk]);
		/* point to next block */
		log_cblk = (log_cblk + 1) & LOG_BLOCKS_MASK;
		log_centry = 0;
		if (log_cblk == 0) /* rollover; update gen number */
			log_gen += 0x4;
		/* erase and load new block */
		page_erase(&battlog[log_cblk]);
		page_read(&battlog[log_cblk]);
	} else {
		/* update current block */
		page_write(&battlog[log_cblk]);
	}
}

static void
log_erase(void)
{
	for (uint8_t c = 0; c < LOG_BLOCKS; c++) {
		page_erase(&battlog[c]);
	}
	log_cblk = log_centry = log_gen = 0;
}

static void
update_log(void)
{
	char c;
	double v;
	int32_t v_i;

	for (c = 0; c < 4; c++) {
		printf("log entry %d/%d ", log_cblk, log_centry);
		if ((pac_ctrl.ctrl_chan_dis & (8 >> c)) != 0)
			continue;
		/* batt_i = acc_value * 0.00075 * 1000 */
		v = (double)l600_current_acc[c] * 0.75 / l600_current_count;
		/* adjust with calibration data */
		switch(c) {
		case 0:
			v = v * 0.988689144013892;
			break;
		case 1:
			v = v * 1.00930129713152;
			break;
		case 2:
			v = v * 4.06331342566096;
			break;
		}
		v_i = (int32_t)(v + 0.5);
		printf(" %d %4.4fA %ld", c, v / 1000, v_i);
		itolog(v_i, &curlog.b_entry[log_centry]);
		/* volt = vbus * 0.000488 */
		/* batt_v = voltages_acc * 0.000488 * 100 / 6000; */
		/* adjust by 0.99955132 from calibration data */
		v = (double)l600_voltages_acc[c] * 0.000008129684;
		v_i = (int32_t)(v + 0.5);
		printf(" %4.3fV %ld", v / 100, v_i);
		utolog((uint16_t)v_i, &curlog.b_entry[log_centry]);
		curlog.b_entry[log_centry].s.instance = c;
#if 0
		XXX
		if (board_temp == 0xffff) {
			curlog.b_entry[log_centry].s.temp = 0xff;
		} else {
			curlog.b_entry[log_centry].s.temp =
			    (uint8_t)((board_temp - 23300) / 100);
		}
#endif
		next_log_entry();
		l600_current_acc[c] = 0;
		l600_voltages_acc[c] = 0;
	}
	l600_current_count = 0;
}

static void
send_log_block(uint8_t sid, uint8_t page)
{
	uint8_t c, i, j, r = 0;

	printf("send page %d\n", page);

