mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	c = 0;
	while (c < LOG_ENTRIES && r == 0) {
		fastid = (fastid + 1) & 0x7;
		msg.id.id = 0;
		msg.id.iso_pg = (PRIVATE_LOG >> 8) & 0xff;
		msg.id.daddr = rid.saddr;
		msg.id.priority = NMEA2000_PRIORITY_ACK;
		msg.dlc = sizeof(struct private_log_reply);
		private_log_cmd.rp.cmd = PRIVATE_LOG_REPLY;
		msg.data = (void *)&private_log_cmd.rp;
		private_log_cmd.rp.sid = sid;
		private_log_cmd.rp.idx =
		   ((uint16_t)(battlog[page].b_flags & B_FILL_GEN) << 8) | page;
		for (i = 0; c < LOG_ENTRIES; c++) {
			if (battlog[page].b_entry[c].s.nvalid == 1) {
				printf("page %d entry %d !valid\n", page, c);
				private_log_cmd.rp.idx |= 0x100;
				r++;
				break;
			}
			for (j = 0; j < sizeof(union log_entry); j++) {
				private_log_cmd.rp.data[i] =
				    battlog[page].b_entry[c].data[j];
				i++; msg.dlc++;
			}
			if (msg.dlc >= (NMEA2000_DATA_FASTLENGTH - sizeof(union log_entry))) {
				c++;
				break;
			}
		}
		if (c == LOG_ENTRIES)
			private_log_cmd.rp.idx |= 0x100;
		printf("send fast len %d/%d, %d entries\n",
		    msg.dlc, i, c);
		if (! nmea2000_send_fast_frame(&msg, fastid))
			printf("send PRIVATE_LOG_REPLY failed\n");
	}
}

static void
send_log_error(uint8_t sid, uint8_t code)
{
	fastid = (fastid + 1) & 0x7;
	msg.id.id = 0;
	msg.id.iso_pg = (PRIVATE_LOG >> 8) & 0xff;
	msg.id.daddr = rid.saddr;
	msg.id.priority = NMEA2000_PRIORITY_ACK;
	msg.dlc = sizeof(struct private_log_error);
	msg.data = (void *)&private_log_cmd.er;
	private_log_cmd.er.cmd = PRIVATE_LOG_ERROR;
	private_log_cmd.er.sid = sid;
	private_log_cmd.er.error = code;
	if (! nmea2000_send_fast_frame(&msg, fastid))
		printf("send PRIVATE_LOG_ERROR failed\n");
}

static void
handle_log_request(uint8_t cmd) {
	uint8_t gen = (private_log_cmd.rq.idx & 0xff00) >> 8;
	uint8_t page = private_log_cmd.rq.idx & 0xff;
	uint8_t sid = private_log_cmd.rq.sid;
	uint8_t i;
	printf("log request sid %d gen %d page %d\n", sid, gen, page);

	if (cmd == PRIVATE_LOG_REQUEST_FIRST) {
		/* look for first log entry - usually next page */
		for (i = 0, page = (log_cblk + 1) & LOG_BLOCKS_MASK;
		    i < LOG_BLOCKS; 
		     page = (page + 1) & LOG_BLOCKS_MASK, i++) {
			if ((battlog[page].b_flags & B_FILL_STAT) !=
			    B_FILL_FREE)
				break;
		}
		if (i == LOG_BLOCKS) {
			/* all entries free (e.g. just after a reset) */
			send_log_error(sid, PRIVATE_LOG_ERROR_NOTFOUND);
			return;
		}
		send_log_block(sid, page);
		return;
	}
	/* look for gen/page */
	if ((battlog[page].b_flags & B_FILL_GEN) != gen ||
	    (battlog[page].b_flags & B_FILL_STAT) == B_FILL_FREE) {
		send_log_error(sid, PRIVATE_LOG_ERROR_NOTFOUND);
		return;
	}
	if (cmd == PRIVATE_LOG_REQUEST) {
		/* just send this page */
		send_log_block(sid, page);
		return;
	}
	/* send next page, if there is one */
	if (page == log_cblk) {
		/* this is the last page */
		send_log_error(sid, PRIVATE_LOG_ERROR_LAST);
		return;
	}
	page = (page + 1) & LOG_BLOCKS_MASK;
	if ((battlog[page].b_flags & B_FILL_STAT) == B_FILL_FREE) {
		/* next page is free, assume previous was the last */
		send_log_error(sid, PRIVATE_LOG_ERROR_LAST);
		return;
	}
	send_log_block(sid, page);
}

static void
adctotemp(u_char c)
{
	char i;
	for (i = 1; temps[i].val != 0; i++) {
		if (ad_temp > temps[i].val) {
			board_temp = temps[i - 1].temp -
			((temps[i - 1].temp - temps[i].temp)  /
		         (temps[i - 1].val - temps[i].val)  * 
			 (temps[i - 1].val - ad_temp));
			return;
		}
	} 
	board_temp = 0xffff;
}

static void
send_batt_status(char c)
{
	if (nmea2000_status != NMEA2000_S_OK)
		return;

	struct nmea2000_battery_status_data *data = (void *)&nmea2000_data[0];

	if ((pac_ctrl.ctrl_chan_dis & (8 >> c)) != 0)
		return;

	PGN2ID(NMEA2000_BATTERY_STATUS, msg.id);
	msg.id.priority = NMEA2000_PRIORITY_INFO;
	msg.dlc = sizeof(struct nmea2000_battery_status_data);
	msg.data = &nmea2000_data[0];
	data->voltage = (int16_t)batt_v[c];
	data->current = batt_i[c];
	data->temp = board_temp;
	data->sid = sid;
	data->instance = c;
	if (! nmea2000_send_single_frame(&msg))
		printf("send NMEA2000_BATTERY_STATUS failed\n");
}

#if 0

static void
send_dc_status(void)
{
	struct nmea2000_dc_status_data *data = (void *)&nmea2000_data[0];
	static u_char fastid;

	if (input_volt == 0xffff)
		return;

	fastid = (fastid + 1) & 0x7;
	printf("power voltage %d.%03dV\n",
	    (int)(input_volt / 1000), (int)(input_volt % 1000));

	PGN2ID(NMEA2000_DC_STATUS, msg.id);
	msg.id.priority = NMEA2000_PRIORITY_INFO;
	msg.dlc = sizeof(struct nmea2000_dc_status_data);
	msg.data = &nmea2000_data[0];
	data->sid = sid;
	data->instance = 0;
	switch(power_status) {
	case UNKOWN:
		return;
	case OFF:
		data->type = DCSTAT_TYPE_BATT;
		if (batt_v > 1240) {
			data->soc = 100 - ((u_long)time_on_batt * 100UL / 7200UL);
		} else {
			data->soc = 50 - (1240 - batt_v) * 50 / (1240 - 1100);
		}
		data->soh = 0xff;
		data->timeremain = 0xffff; /* XXX compute */
		data->ripple = 0xffff;
		break;
	default:
		/* assume operating on mains power */
		data->type = DCSTAT_TYPE_CONV;
		data->soc = 0xff;
		data->soh =
		    ((u_long)input_volt * 100UL + 6000UL) / 12000;
		data->timeremain = 0xffff;
		data->ripple = 0xffff;
		break;
	}
	if (! nmea2000_send_fast_frame(&msg, fastid))
		printf("send NMEA2000_DC_STATUS failed\n");
}

static void
send_charger_status()
{
	struct nmea2000_charger_status_data *data = (void *)&nmea2000_data[0];

	PGN2ID(NMEA2000_CHARGER_STATUS, msg.id);
	msg.id.priority = NMEA2000_PRIORITY_INFO;
	msg.dlc = sizeof(struct nmea2000_charger_status_data);
	msg.data = &nmea2000_data[0];
	data->instance = 0;
	data->batt_instance = 0;
	data->op_state = charger_status;
	data->mode = CHARGER_MODE_STANDALONE;
	data->enable = 1;
	data->eq_pending = 0;
	data->eq_time_remain = 0;
	if (! nmea2000_send_single_frame(&msg))
		printf("send NMEA2000_CHARGER_STATUS failed\n");
}
#endif

void
user_handle_iso_request(u_long pgn)
{
	printf("ISO_REQUEST for %ld from %d\n", pgn, rid.saddr);
	switch(pgn) {
	case NMEA2000_BATTERY_STATUS:
		for (char c = 0; c < 4; c++) {
			if ((pac_ctrl.ctrl_chan_dis & (8 >> c)) == 0)
				send_batt_status(c);
		}
		break;
#if 0
	case NMEA2000_DC_STATUS:
		send_dc_status();
		break;
	case NMEA2000_CHARGER_STATUS:
		send_charger_status();
		break;
#endif
	}
}

void
user_receive()
{
	u_long pgn;

