mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	pgn = ((u_long)rid.page << 16) | ((u_long)rid.iso_pg << 8);
	if (rid.iso_pg > 239)
		pgn |= rid.daddr;

	switch(pgn) {
	case PRIVATE_LOG:
	    {
		u_char idx = (rdata[0] & FASTPACKET_IDX_MASK);
		u_char id =  (rdata[0] & FASTPACKET_ID_MASK);
		char i, j;

		if (idx == 0) {
			/* new head packet */
			logreq_id = id;
			logreq_len = rdata[1];
			for (i = 0; i < 6 && logreq_len > 0; i++) {  
				private_log_cmd._data[i] = rdata[i+2];
				logreq_len--;
			}       
		} else if (id == logreq_id) {
			j = 1;
			/* i = 6 + (idx - 1) * 7 : i = idx * 7 - 1 */   
			for (i = idx * 7 - 1, j = 1;
			    i < sizeof(private_log_cmd) && j < 8 &&
			        logreq_len > 0;
			    i++, j++) {
				private_log_cmd._data[i] = rdata[j];  
				logreq_len--;
			}
		}

		if (logreq_len == 0) {
			switch(private_log_cmd.rq.cmd) {
			case PRIVATE_LOG_REQUEST:
			case PRIVATE_LOG_REQUEST_FIRST:
			case PRIVATE_LOG_REQUEST_NEXT:
				handle_log_request(private_log_cmd.rq.cmd);
				break;
			case PRIVATE_LOG_RESET:
				printf("log reset from %d ", rid.saddr);
				if (rid.daddr != nmea2000_addr) {
					printf("ignored, wrong daddr %d\n",
					    rid.daddr);
				} else if (private_log_cmd.rst.magic != 
				    PRIVATE_LOG_RESET_MAGIC) {
					printf("ignored, wrong magic 0x%x\n",
					    private_log_cmd.rst.magic);
				} else {
					log_erase();
					printf("done\n");
				}
				break;
			default:
				printf("wrong log cmd %d from %d\n",
				    private_log_cmd.rq.cmd, rid.saddr);
			}
		}
		break;
	    }
	}
}

void
putch(char c)
{
        if (PORTBbits.RB7) {
		usart_putchar(c);
	}
}

static union pacops_pending {
	struct pacops_bits {
		char refresh : 1;	/* send a refresh command */
		char refresh_v : 1;	/* send a refresh_v command */
		char read_values : 1;	/* read average values */
		char read_accum : 1;	/* read accumulator values */
	} bits;
	char byte;
} pacops_pending;

u_int pac_refresh_time;
u_char pac_refresh_valid;

static void
pac_command_complete(void)
{
	switch(pac_i2c_io.pac_type) {
	case PAC_WRITE:
		if (pac_i2c_io.pac_reg == PAC_REFRESH ||
		    pac_i2c_io.pac_reg == PAC_REFRESH_V) {
			pac_refresh_time = timer0_read();
			pac_refresh_valid = 1;
		}
		break;
	case PAC_READ_AVG:
		softintrs.bits.int_pacavg = 1;
		break;
	case PAC_READ_ACCUM:
		softintrs.bits.int_pacacc = 1;
		break;
	default:
		printf("unknown pac_complete %d\n", pac_i2c_io.pac_type);
		break;
	}
	pac_i2c_io.pac_type = PAC_FREE;
	pac_i2c_state = PAC_I2C_IDLE;
}

static void
pac_command_schedule(void)
{
	if (pac_i2c_state != PAC_I2C_IDLE)
		return;

	if (pacops_pending.bits.refresh) {
		pacops_pending.bits.refresh_v = 0;
		pacops_pending.bits.refresh = 0;
		pac_refresh_valid = 0;
		PAC_WRITECMD(PAC_REFRESH);
		return;
	}
	if (pacops_pending.bits.refresh_v) {
		pacops_pending.bits.refresh_v = 0;
		PAC_WRITECMD(PAC_REFRESH_V);
		pac_refresh_valid = 0;
		return;
	}
	if ((pacops_pending.bits.read_values ||
	    pacops_pending.bits.read_accum) && pac_refresh_valid) {
		if ((timer0_read() - pac_refresh_time) < TIMER0_1MS)
			return;
		if (pacops_pending.bits.read_values) {
			pacops_pending.bits.read_values = 0;
			pac_i2c_io.pac_type = PAC_READ_AVG;
			softintrs.bits.int_pacavg = 0;
		} else {
			pacops_pending.bits.read_accum = 0;
			pac_i2c_io.pac_type = PAC_READ_ACCUM;
			softintrs.bits.int_pacacc = 0;
		}
		pac_i2c_state = PAC_I2C_WAIT;
		return;
	}
}

#if 0
static void
read_pac_channel(void)
{
	char c;
	static pac_acccnt_t pac_acccnt;
	int64_t acc_value;
	double v;

	i2c_readreg_be(PAC_I2C_ADDR, PAC_ACCCNT,
	    (void *)&pac_acccnt, sizeof(pac_acccnt), &i2c_return);
	if (i2c_wait(&i2c_return) != 0) {
		printf("read pac_acccnt fail\n");
		pac_acccnt.acccnt_count = 0;
		return;
	} 
	printf("\n %d count %lu", NCANOK, pac_acccnt.acccnt_count);
	l600_current_count += pac_acccnt.acccnt_count;

	for (c = 0; c < 4; c++) {
		if ((pac_ctrl.ctrl_chan_dis & (8 >> c)) != 0)
			continue;

		acc_value = 0;
		i2c_readreg_be(PAC_I2C_ADDR, PAC_ACCV1 + c,
		    (void *)&acc_value, 7, &i2c_return);
		if (i2c_wait(&i2c_return) != 0) {
			printf("read acc_value[%d] fail\n", c);
			continue;
		}
		if (acc_value & 0x0080000000000000) {
			/* adjust negative value */
			acc_value |= 0xff00000000000000;
		}
		l600_current_acc[c] += acc_value;
		/* batt_i = acc_value * 0.00075 * 100 */
		v = (double)acc_value * 0.075 / pac_acccnt.acccnt_count;
		/* adjust with calibration data */
		switch(c) {
		case 0:
			v = v * 0.988689144013892;
			break;
		case 1:
			v = v * 1.00930129713152;
			break;
		case 2:
			v = v * 4.06331342566096;
			break;
		}
		batt_i[c] = (int16_t)(v + 0.5);
		printf(" %d %4.4fA", c, v / 100);
		/* volt = vbus * 0.000488 */
		/* batt_v = voltages_acc * 0.000488 * 100 / 10; */
		/* adjust by 0.99955132 from calibration data */
		v = (double)voltages_acc[c] * 0.0048778104;
		batt_v[c] = (int16_t)(v + 0.5);
		printf(" %4.3fV", v / 100);
	}
}
#endif

#define OLED_ADDR 0x78 // 0b01111000
#define OLED_DISPLAY_SIZE 1024 /* 128 * 64 / 8 */
#define OLED_DISPLAY_W 128
#define OLED_DISPLAY_H (64 / 8)

#define DISPLAY_FONTSMALL_W     6

char oled_displaybuf[OLED_DISPLAY_W / DISPLAY_FONTSMALL_W];
static u_char oled_col;
static u_char oled_line;

char oled_error; /* is display in error state ? */

u_char bright;

/* i2c OLED specific */

#define OLED_I2C_DATABUFSZ	256
#define OLED_I2C_CTRLBUFSZ	16
#define OLED_NBUFS		4

static struct oled_i2c_buf_s {
	u_char oled_databuf[OLED_I2C_DATABUFSZ];
	u_char oled_ctrlbuf[OLED_I2C_CTRLBUFSZ];
	uint16_t  oled_datalen;
	u_char oled_ctrllen;
	enum {
		OLED_CTRL_FREE,
		OLED_CTRL_CLEAR,
		OLED_CTRL_CMD,
		OLED_CTRL_DISPLAY,
	} oled_type;
} oled_i2c_buf[OLED_NBUFS];

static enum {
	OLED_I2C_IDLE,
	OLED_I2C_ERROR, /* got error */
	OLED_I2C_COMPLETE, /* transaction complete */
	OLED_I2C_WAIT, /* waiting for i2c bus */
	OLED_I2C_CMD, /* command sent */
	OLED_I2C_DATA, /* data sent */
} oled_i2c_state;

static u_char oled_i2c_prod;
static u_char oled_i2c_cons;

static void
_oled_i2c_exec(void)
{
	struct oled_i2c_buf_s *oled_s;

	switch(oled_i2c_state) {
	case OLED_I2C_IDLE:
	case OLED_I2C_COMPLETE:
	case OLED_I2C_ERROR:
		return;
	case OLED_I2C_WAIT:
		while (oled_i2c_buf[oled_i2c_cons].oled_type == OLED_CTRL_FREE) {
			oled_i2c_cons = (oled_i2c_cons + 1) & (OLED_NBUFS - 1);
			if (oled_i2c_cons == oled_i2c_prod &&
			    oled_i2c_buf[oled_i2c_cons].oled_type == OLED_CTRL_FREE) {
				return;
			}
		}
		oled_s = &oled_i2c_buf[oled_i2c_cons];
		i2c_writereg(OLED_ADDR, 0, &oled_s->oled_ctrlbuf[0],
		    oled_s->oled_ctrllen, &i2c_return);
		oled_i2c_state = OLED_I2C_CMD;
		return;
	case OLED_I2C_CMD:
		oled_s = &oled_i2c_buf[oled_i2c_cons];
		switch(i2c_return) {
		case I2C_INPROGRESS:
			return;
		case I2C_ERROR:
			if (!oled_error)
				printf("oled_i2c_exec CMD fail (%d)\n",
				    oled_s->oled_type);
			oled_i2c_state = OLED_I2C_ERROR;
			oled_error = 1;
			return;
		case I2C_COMPLETE:
			oled_error = 0;
			break;
		}
		switch(oled_s->oled_type) {
		case OLED_CTRL_DISPLAY:
			i2c_writereg_dma(OLED_ADDR, 0x40, &oled_s->oled_databuf[0],
			    oled_s->oled_datalen, &i2c_return);
			oled_i2c_state = OLED_I2C_DATA;
			return;
		case OLED_CTRL_CMD:
			oled_i2c_state = OLED_I2C_COMPLETE;
			return;
		case OLED_CTRL_CLEAR:
			break;
		default:
			printf("oled_i2c_exec: OLED_I2C_CMD cons %d cons_state %d\n",
			    oled_i2c_cons,
			    oled_i2c_buf[oled_i2c_cons].oled_type);
			return;
		}
		/* FALLTHROUGH */
	case OLED_I2C_DATA:
		oled_s = &oled_i2c_buf[oled_i2c_cons];
		switch(i2c_return) {
		case I2C_INPROGRESS:
			return;
		case I2C_ERROR:
			if (!oled_error)
				printf("oled_i2c_exec DATA fail (%d)\n",
				    oled_s->oled_type);
			oled_i2c_state = OLED_I2C_ERROR;
			oled_error = 1;
			return;
		case I2C_COMPLETE:
			break;
		}
		switch(oled_s->oled_type) {
		case OLED_CTRL_DISPLAY:
			oled_i2c_state = OLED_I2C_COMPLETE;
			return;
		case OLED_CTRL_CLEAR:
			if (oled_s->oled_datalen != 0) {
				i2c_writereg_dma(OLED_ADDR, 0x40,
				    &oled_s->oled_databuf[0],
				    OLED_I2C_DATABUFSZ, &i2c_return);
				oled_s->oled_datalen -= OLED_I2C_DATABUFSZ;
				oled_i2c_state = OLED_I2C_DATA;
			} else {
				oled_i2c_state = OLED_I2C_COMPLETE;
			}
			return;
		default:
			break;
		}
	default:
		printf("oled_i2c_exec: state %d cons %d cons_state %d\n",
		    oled_i2c_state, oled_i2c_cons,
		    oled_i2c_buf[oled_i2c_cons].oled_type);
	}
}

static void
oled_i2c_exec(void)
{
	_oled_i2c_exec();
	if (oled_i2c_state == OLED_I2C_COMPLETE) {
		oled_i2c_buf[oled_i2c_cons].oled_type = OLED_CTRL_FREE;
		oled_i2c_state = OLED_I2C_IDLE;
	}
	if (oled_i2c_state == OLED_I2C_IDLE &&
	    oled_i2c_cons != oled_i2c_prod) {
		/* schedule next command */
		oled_i2c_cons = (oled_i2c_cons + 1) & (OLED_NBUFS - 1);
		oled_i2c_state = OLED_I2C_WAIT;
	}
}

