mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
static char
oled_i2c_flush(void)
{
	while (oled_i2c_state != OLED_I2C_IDLE) {
		oled_i2c_exec();
		if (oled_i2c_state == OLED_I2C_ERROR) {
			printf("oled_i2c_flush: error %d state %d cons %d cons_state %d\n",
			    i2c_return, oled_i2c_state, oled_i2c_cons,
			    oled_i2c_buf[oled_i2c_cons].oled_type);
			oled_i2c_state = OLED_I2C_IDLE;
			oled_i2c_buf[oled_i2c_cons].oled_type = OLED_CTRL_FREE;
			oled_i2c_exec();
		} else {
			i2c_wait(&i2c_return); /* will deal with timeout */
		}
	}
	return 1;
}
			

#define OLED_CTRL(s, c) \
        {(s)->oled_ctrlbuf[(s)->oled_ctrllen++] = (c);}

static struct oled_i2c_buf_s *
oled_i2c_reset(void)
{
	/* select next free slot */
	while (oled_i2c_buf[oled_i2c_prod].oled_type != OLED_CTRL_FREE) {
		u_char new_i2c_prod;
		new_i2c_prod = (oled_i2c_prod + 1) & (OLED_NBUFS - 1);
		if (new_i2c_prod == oled_i2c_cons) {
			/* no free slot */
			return NULL;
		}
		oled_i2c_prod = new_i2c_prod;
	}
	oled_i2c_buf[oled_i2c_prod].oled_datalen = 0;
	oled_i2c_buf[oled_i2c_prod].oled_ctrllen = 0;
	return &oled_i2c_buf[oled_i2c_prod];
}
#define OLED_CTRL_WRITE {oled_s->oled_type = OLED_CTRL_CMD; oled_i2c_state = OLED_I2C_WAIT; oled_i2c_flush(); oled_i2c_reset();}
	
static void
displaybuf_small(void)
{
	const u_char *font;
	char *cp;
	u_char len;
	u_char i;
	struct oled_i2c_buf_s *oled_s;

	if ((oled_s = oled_i2c_reset()) == NULL)
		return;

	len = 0;
	for (cp = oled_displaybuf; *cp != '\0'; cp++) {
		if (*cp == '\n' && len == 0) {
			len = (u_char)oled_s->oled_datalen;
			continue;
		}
		font = get_font5x8(*cp);
		for (i = 0; i < 5; i++) {
			oled_s->oled_databuf[oled_s->oled_datalen++] = font[i];
		}
		oled_s->oled_databuf[oled_s->oled_datalen++] = 0;
	}
	if (len == 0)
		len = (u_char)oled_s->oled_datalen;
	/* set column start/end */
	OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x10);  /* reset column start */
	OLED_CTRL(oled_s, 0x21); OLED_CTRL(oled_s, oled_col);
	    OLED_CTRL(oled_s, oled_col + len - 1); /*column start/end */
	/* set page address */
	OLED_CTRL(oled_s, (oled_line & 0x07 ) | 0xb0 );
	oled_s->oled_type = OLED_CTRL_DISPLAY;
	if (oled_i2c_state == OLED_I2C_IDLE)
		oled_i2c_state = OLED_I2C_WAIT;
}

static void
displaybuf_medium(void)
{
	const u_char *font;
	char *cp;
	u_char i, n;
	struct oled_i2c_buf_s *oled_s;

	if ((oled_s = oled_i2c_reset()) == NULL)
		return;
	/* unfortunably we can't build the two lines in a single loop */
	for (n = 0, cp = oled_displaybuf; *cp != '\0'; cp++) {
		font = get_font10x16(*cp);
		for (i = 0; i < 10; i++, n++) {
			oled_s->oled_databuf[n] = font[i * 2];
		}
	}
	for (cp = oled_displaybuf; *cp != '\0'; cp++) {
		font = get_font10x16(*cp);
		for (i = 0; i < 10; i++, n++) {
			oled_s->oled_databuf[n] = font[i * 2 + 1];
		}
	}
	oled_s->oled_datalen = n;
	OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x10);  /* reset column start */
	OLED_CTRL(oled_s, 0x21); OLED_CTRL(oled_s, oled_col); OLED_CTRL(oled_s, oled_col + n / 2 - 1); /*column start/end */
	/* set page address */
	OLED_CTRL(oled_s, (oled_line & 0x07 ) | 0xb0 );
	oled_s->oled_type = OLED_CTRL_DISPLAY;
	if (oled_i2c_state == OLED_I2C_IDLE)
		oled_i2c_state = OLED_I2C_WAIT;
}

static void
displaybuf_icon(char ic)
{
	const u_char *icon;
	char *cp;
	u_char i;
	struct oled_i2c_buf_s *oled_s;

	if ((oled_s = oled_i2c_reset()) == NULL)
		return;
	icon = get_icons16x16(ic);
	for (i = 0; i < 16; i++) {
		oled_s->oled_databuf[i] = icon[i * 2];
		oled_s->oled_databuf[i + 16] = icon[i * 2 + 1];
	}
	oled_s->oled_datalen = 32;
	OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x10);  /* reset column start */
	OLED_CTRL(oled_s, 0x21); OLED_CTRL(oled_s, oled_col); OLED_CTRL(oled_s, oled_col + 16 - 1); /*column start/end */
	/* set page address */
	OLED_CTRL(oled_s, (oled_line & 0x07 ) | 0xb0 );
	oled_s->oled_type = OLED_CTRL_DISPLAY;
	if (oled_i2c_state == OLED_I2C_IDLE)
		oled_i2c_state = OLED_I2C_WAIT;
}

static void
dislplay_battstat(u_char b)
{
	double amps = (double)batt_i[b] / 100;
	double volts = (double)batt_v[b] / 100;
	if (amps > 9.99 || amps < 0) {
		if (volts < 10.0) {
			sprintf(oled_displaybuf,
			    " %1.01fV\n-.--A", volts);
		} else {
			sprintf(oled_displaybuf,
			    "%2.01fV\n-.--A", volts);
		}
	} else {
		if (volts < 10.0) {
			sprintf(oled_displaybuf,
			    " %1.01fV\n%1.02fA", volts, amps);
		} else {
			sprintf(oled_displaybuf,
			    "%2.01fV\n%1.02fA", volts, amps);
		}
	}
	displaybuf_small();
}

int
main(void)
{
	char c;
	uint16_t l;
	uint8_t i2cr;
	pac_accumcfg_t pac_accumcfg;
	pac_neg_pwr_fsr_t pac_neg_pwr_fsr;
	static u_int poll_count;
	uint16_t t0;
	static int32_t voltages_acc_cur[4];
	uint8_t new_boot;
	struct oled_i2c_buf_s *oled_s;

	default_src = 0;
	devid = 0;
	revid = 0;
	nmea2000_user_id = 0;
	/* read devid and user IDs */
	TBLPTR = 0x200000;
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id;");
	asm("tblrd*+;");
	asm("movff TABLAT, _nmea2000_user_id + 1;");
	TBLPTR = 0x3ffffc;
	asm("tblrd*+;");
	asm("movff TABLAT, _revid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _revid + 1;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid;");
	asm("tblrd*+;");
	asm("movff TABLAT, _devid + 1;");

	/* disable unused modules */
	PMD0 = 0x3a; /* keep clock, FVR, and IOC */
#ifdef USE_TIMER2
	PMD1 = 0xfa; /* keep timer0/timer2 */
	PMD2 = 0x03; /* keep can module */
#else
	PMD1 = 0xfe; /* keep timer0 */
	PMD2 = 0x02; /* keep can module, TU16A */
#endif
	PMD3 = 0xd9; /* keep ADC, CM1, CM2 */
	PMD4 = 0xff;
	PMD5 = 0xef; /* keep PWM1 */
	PMD6 = 0xf6; /* keep UART1 and I2C */
	PMD7 = 0xf3; /* keep CLC3 and CLC4 */
	PMD8 = 0xfe; /* keep DMA1 */

	ANSELC = 0;
	ANSELB = 0;
	ANSELA = 0x2F; /* RA0, RA1, RA2, RA3 and RA5 analog */

	/* CANRX on RB3 */
	CANRXPPS = 0x0B;
	/* CANTX on RB2 */
	LATBbits.LATB2 = 1; /* output value when idle */
	TRISBbits.TRISB2 = 0;
	RB2PPS = 0x46;

	LATA = 0;
	OLED_RSTN = 0;
	PAC_NDOWN = 0;
	TRISAbits.TRISA4 = 0; /* RA4/OLED_RSTN as outpout */
	TRISCbits.TRISC7 = 0; /* RC7/NDOWN output */

	/* configure watchdog timer for 2s */
	WDTCON0 = 0x16;
	WDTCON1 = 0x07;

	/* configure sleep mode: PRI_IDLE */
	CPUDOZE = 0x80;

