mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	/*
	 * configure priotities memory access priorities
	 * ISR > DMA1 > main
	 */
	PRLOCK = 0x55;
	PRLOCK = 0xAA;
	PRLOCKbits.PRLOCKED = 0;
	ISRPR = 0;
	MAINPR = 4;
	DMA1PR = 3;
	PRLOCK = 0x55;
	PRLOCK = 0xAA;
	PRLOCKbits.PRLOCKED = 1;


	softintrs.byte = 0;
	counter_10hz = 25;
	counter_1hz = 10;
	seconds = 0;

	for (c = 0; c < 4; c++) {
		voltages_acc_cur[c] = 0;
		l600_current_acc[c] = 0;
		l600_voltages_acc[c] = 0;
	}
	l600_current_count = 0;

	IPR1 = 0;
	IPR2 = 0;
	IPR3 = 0;
	IPR4 = 0;
	IPR5 = 0;
	IPR6 = 0;
	IPR7 = 0;
	IPR8 = 0;
	IPR9 = 0;
	IPR10 = 0;
	IPR11 = 0;
	IPR12 = 0;
	IPR13 = 0;
	IPR14 = 0;
	IPR15 = 0;
	INTCON0 = 0;
	INTCON1 = 0;
	INTCON0bits.IPEN=1; /* enable interrupt priority */

	USART_INIT(0);

	/* configure timer0 as free-running counter at 9.765625Khz */
	T0CON0 = 0x0;
	T0CON0bits.MD16 = 1; /* 16 bits */
	T0CON1 = 0x48; /* 01001000 Fosc/4, sync, 1/256 prescale */
	PIR3bits.TMR0IF = 0;
	PIE3bits.TMR0IE = 0; /* no interrupt */
	T0CON0bits.T0EN = 1;

#ifdef USE_TIMER2
	/* configure timer2 for 250Hz interrupt */
	T2CON = 0x44; /* b01000100: postscaller 1/5, prescaler 1/16 */
	T2PR = 125; /* 250hz output */
	T2CLKCON = 0x01; /* Fosc / 4 */
	T2CONbits.TMR2ON = 1;
	PIR3bits.TMR2IF = 0;
	IPR3bits.TMR2IP = 1; /* high priority interrupt */
	PIE3bits.TMR2IE = 1;
#else
	/* configure UTMR for 10Hz interrupt */
	TU16ACON0 = 0x04; /* period match IE */
	TU16ACON1 = 0x00;
	TU16AHLT = 0x00; /* can't use hardware reset because of HW bug */
	TU16APS = 249; /* prescaler = 250 -> 40000 Hz */
	TU16APRH = (4000 >> 8) & 0xff;
	TU16APRL = 4000 & 0xff;
	TU16ACLK = 0x2; /* Fosc */
	TUCHAIN = 0;
	TU16ACON0bits.ON = 1;
	TU16ACON1bits.CLR = 1;
	IPR0bits.TU16AIP = 1; /* high priority interrupt */
	PIE0bits.TU16AIE = 1;
#endif

	i2c_init();

	INTCON0bits.GIEH=1;  /* enable high-priority interrupts */   
	INTCON0bits.GIEL=1; /* enable low-priority interrrupts */   

	printf("hello user_id 0x%lx devid 0x%x revid 0x%x\n", nmea2000_user_id, devid, revid);

	printf("n2k_init\n");
	nmea2000_init();
	poll_count = timer0_read();

	/* enable watchdog */
	WDTCON0bits.SEN = 1;

	/* set up ADC */
	ADCON0 = 0x4; /* right-justified */
	ADCLK = 7; /* Fosc/16 */
	/* context 0: PWM_v */
	ADCTX = 0;
	ADCON1 = 0; /* no cap */
	ADCON2 = 0; /* basic mode */
	ADCON3 = 0x08; /* SOI */
	ADREF = 2;  /* vref = vref+ (RA3) */
	ADPCH = 0; /* RA0 */
	ADACQH = 0;
	ADACQL = 20; /* 20Tad Aq */
	/* context 1: solar_v */
	ADCTX = 1;
	ADCON1 = 0; /* no cap */
	ADCON2 = 0; /* basic mode */
	ADCON3 = 0x08; /* SOI */
	ADREF = 2;  /* vref = vref+ (RA3) */
	ADPCH = 2; /* RA2 */
	ADACQH = 0;
	ADACQL = 20; /* 20Tad Aq */
	/* XXX setup thresholds */
	/* context 2: NTC */
	ADCTX = 2;
	ADCON1 = 0; /* no cap */
	ADCON2 = 0; /* basic mode */
	ADCON3 = 0x0f; /* SOI, always interrupt */
	ADREF = 0;  /* vref = VDD */
	ADPCH = 5; /* RA5 */
	ADACQH = 0;
	ADACQL = 20; /* 20Tad Aq */

	/* XXX setup thresholds */
	/* context 3: buttons */
	ADCTX = 3;
	ADCON1 = 0; /* no cap */
	ADCON2 = 0; /* basic mode */
	ADCON3 = 0x0f; /* SOI, always interrupt */
	ADREF = 0;  /* vref = VDD */
	ADPCH = 1; /* RA1 */
	ADACQH = 0;
	ADACQL = 20; /* 20Tad Aq */

	ADCSEL1 = 0x80; /* CHEN */
	ADCSEL2 = 0x80;
	ADCSEL3 = 0xc0; /* CHEN | SSI */
	ADCSEL4 = 0x00;

	PIR2bits.ADCH1IF = 0;
	PIR2bits.ADCH2IF = 0;
	PIR2bits.ADCH3IF = 0;
	PIR2bits.ADCH4IF = 0;
	PIE2bits.ADCH1IE = 0;
	PIE2bits.ADCH2IE = 0;
	PIE2bits.ADCH3IE = 0;
	PIE2bits.ADCH4IE = 0;

	ADCON0bits.ADON = 1;

	ad_pwm = ad_solar = ad_temp = 0xffff;

	printf("display init");
	oled_i2c_prod = oled_i2c_cons = 0;
	oled_error = 0;
	oled_i2c_state = OLED_I2C_IDLE;
	for (c = 0; c < OLED_NBUFS; c++) {
		oled_i2c_buf[c].oled_type = OLED_CTRL_FREE;
	}
	/* setup OLED */
	oled_s = &oled_i2c_buf[oled_i2c_prod];
	for (l = 0; l < 1000; l++)    
		CLRWDT();
	OLED_RSTN = 1;
	for (l = 0; l < 1000; l++)    
		CLRWDT();
	printf(" 1");

	/* command lock */
	oled_i2c_reset();
	OLED_CTRL(oled_s, 0xfd); OLED_CTRL(oled_s, 0x12);
	OLED_CTRL_WRITE;
	CLRWDT();

	/* display off */
	OLED_CTRL(oled_s, 0xae);
	OLED_CTRL_WRITE;
	CLRWDT();

	/* set freq */
	OLED_CTRL(oled_s, 0xd5); OLED_CTRL(oled_s, 0xa0);
	OLED_CTRL_WRITE;
	CLRWDT();
	/* set multiplexer */
	OLED_CTRL(oled_s, 0xa8); OLED_CTRL(oled_s, 0x3f);
	OLED_CTRL_WRITE;
	CLRWDT();

	/* display offset */
	OLED_CTRL(oled_s, 0xd3); OLED_CTRL(oled_s, 0x00);
	/* start line */
	OLED_CTRL(oled_s, 0x40);
	/* segment remap */
	OLED_CTRL(oled_s, 0xa0);
	/* com output scan direction */
	OLED_CTRL(oled_s, 0xc0);
	/* com pin hardware config */
	OLED_CTRL(oled_s, 0xda); OLED_CTRL(oled_s, 0x12);
	/* current control */
	// OLED_CTRL(oled_s, 0x81); OLED_CTRL(oled_s, 0xdf);
	OLED_CTRL(oled_s, 0x81); OLED_CTRL(oled_s, bright);
	/* pre-charge period */
	OLED_CTRL(oled_s, 0xd9); OLED_CTRL(oled_s, 0x82);
	/* vcomh deselect level */
	OLED_CTRL(oled_s, 0xdb); OLED_CTRL(oled_s, 0x34);
	/* entire display on/off */
	OLED_CTRL(oled_s, 0xa4);
	/* normal/inverse */
	OLED_CTRL(oled_s, 0xa6);
	OLED_CTRL_WRITE;
	CLRWDT();
	/* clear RAM */
	OLED_CTRL(oled_s, 0x20); OLED_CTRL(oled_s, 0x00); /* horizontal addressing mode */
	OLED_CTRL(oled_s, 0x21); OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x7f); /*column start/end */
	OLED_CTRL(oled_s, 0x22); OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x07); /*page start/end */
	OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x10);  /* column start */
	OLED_CTRL_WRITE;
	CLRWDT();
	memset(oled_s->oled_databuf, 0, OLED_I2C_DATABUFSZ);
	printf(" buf size %d", (int)OLED_I2C_DATABUFSZ);
	oled_s->oled_databuf[0] = 0x1;
	oled_s->oled_datalen = OLED_DISPLAY_SIZE;
	OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x10);  /* reset column start */
	OLED_CTRL(oled_s, 0x21); OLED_CTRL(oled_s, 0); OLED_CTRL(oled_s, 0x7f); /*column start/end */
	OLED_CTRL(oled_s, 0xb0); /* page start */
	oled_s->oled_type = OLED_CTRL_CLEAR;
	oled_i2c_state = OLED_I2C_WAIT;
	oled_i2c_flush();

	/* set display on */
	oled_i2c_reset();
	OLED_CTRL(oled_s, 0xaf);
	OLED_CTRL_WRITE;
	CLRWDT();
	printf(" done\n");

	PAC_NDOWN = 1;
	pacops_pending.byte = 0;
	/* wait 50ms for pac1953 to be up */
	for (c = 0; c < 50; c++) {
		t0 = timer0_read();
		while (timer0_read() - t0 < TIMER0_1MS) {
			; /* wait */
		}
	}

#ifdef USELOG
#if 0
	log_erase();
#endif

	/* look for current block */
	printf("blocks");
	for (c = 0; c < LOG_BLOCKS; c++) {
		printf(" 0x%x", battlog[c].b_flags);
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_PART) {
			/* found it */
			log_cblk = c;
			log_gen = battlog[c].b_flags & B_FILL_GEN;
			break;
		}
		if ((battlog[c].b_flags & B_FILL_STAT) == B_FILL_FULL) {
			uint8_t c2 = (c + 1) & LOG_BLOCKS_MASK;
			if ((battlog[c2].b_flags & B_FILL_STAT)
			    == B_FILL_FREE) {
				/* stopped just at boundary */
				log_cblk = c2;
				log_gen = battlog[c].b_flags & B_FILL_GEN;
				if (log_cblk == 0)
					log_gen += 0x4;
				break;
			}
		}
	}
	printf("\n");
	if (c == LOG_BLOCKS) {
		/* log empty, start a 0 */
		printf("log empty\n");
		log_cblk = 0;
		log_gen = 0;
	}
	/* look for first free entry in block */
	for (c = 0; c < LOG_ENTRIES; c++) {
		if (battlog[log_cblk].b_entry[c].s.nvalid == 1) {
			/* first free entry */
			log_centry = c;
			break;
		}
	}
	if (c == LOG_ENTRIES) {
		/* log corrupted, reset */
		printf("non-full block with no free entry: reset log\n");
		log_erase();
	}
	page_read(&battlog[log_cblk]);

	memset(&curlog.b_entry[log_centry], 0, sizeof(union log_entry));

	next_log_entry();
#endif /* USELOG */

again:
	c = 0;
	PAC_READREG(PAC_PRODUCT, i2cr);
	if (pac_i2c_flush() == 0)
		c++;
	else 
		printf("product id 0x%x ", i2cr);

	PAC_READREG(PAC_MANUF, i2cr);
	if (pac_i2c_flush() == 0)
		c++;
	else
		printf("manuf id 0x%x ", i2cr);

	PAC_READREG(PAC_REV, i2cr);
	if (pac_i2c_flush() == 0)
		c++;
	else
		printf("rev id 0x%x\n", i2cr);

	PAC_READREG(PAC_CTRL_ACT, pac_ctrl);
	if (pac_i2c_flush() == 0)
		c++;
	else {
		printf("CTRL_ACT al1 %d al2 %d mode %d dis %d\n",
		    pac_ctrl.ctrl_alert1,
		    pac_ctrl.ctrl_alert2,
		    pac_ctrl.ctrl_mode,
		    pac_ctrl.ctrl_chan_dis);
	}

	pac_ctrl.ctrl_alert1 = pac_ctrl.ctrl_alert2 = CTRL_ALERT_ALERT;
	pac_ctrl.ctrl_mode = CTRL_MODE_1024;
	pac_ctrl.ctrl_chan_dis = 0x1;

	PAC_WRITEREG(PAC_CTRL, pac_ctrl);
	if (pac_i2c_flush() == 0) {
		printf("wr PAC_CTRL fail\n");
		c++;
	}

	pac_accumcfg.accumcfg_acc1 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc2 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc3 = ACCUMCFG_VSENSE;
	pac_accumcfg.accumcfg_acc4 = ACCUMCFG_VSENSE;
	PAC_WRITEREG(PAC_ACCUMCFG, pac_accumcfg);
	if (pac_i2c_flush() == 0) {
		printf("wr PAC_ACCUMCFG fail\n");
		c++;
	}

	pac_neg_pwr_fsr.pwrfsr_vs1 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vs2 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vs3 = PAC_PWRSFR_BHALF;
	pac_neg_pwr_fsr.pwrfsr_vs4 = PAC_PWRSFR_BHALF;

	pac_neg_pwr_fsr.pwrfsr_vb1 = PAC_PWRSFR_UFSR;
	pac_neg_pwr_fsr.pwrfsr_vb2 = PAC_PWRSFR_UFSR;
	pac_neg_pwr_fsr.pwrfsr_vb3 = PAC_PWRSFR_UFSR;
	pac_neg_pwr_fsr.pwrfsr_vb4 = PAC_PWRSFR_UFSR;
	PAC_WRITEREG(PAC_NEG_PWR_FSR, pac_neg_pwr_fsr);
	if (pac_i2c_flush() == 0) {
		printf("wr PAC_NEG_PWR_FSR fail\n");
		c++;
	}

	PAC_WRITECMD(PAC_REFRESH);
	if (pac_i2c_flush() == 0) {
		printf("cmd PAC_REFRESH fail\n");
		c++;
	}
	if (c != 0)
		goto again;

	/* set up some of our input/output */
	PWM_OFF = 1;
	TRISCbits.TRISC1 = 0;

