mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
	PWM_MID = 0;
	TRISCbits.TRISC5 = 0;
	PWM_OUT = 0;
	TRISCbits.TRISC6 = 0;

	TRISCbits.TRISC0 = 1; /* PWM_OK input */


	LATBbits.LATB4 = 0; /* BATT1_ON */
	LATBbits.LATB5 = 0; /* BATT2_ON */
	TRISBbits.TRISB4 = 0;
	TRISBbits.TRISB5 = 0;

	/*
	 * set up CLC for BATT1/BATT2 outputs:
	 * On only if
	 *   - PWM_OFF == 0
	 *   - PWM_OK == 1
	 *   - PWM_MID == 1
	 *   - the other batt is off
	 *   - we want it on
	 */

	/* CLC inputs - carefull with what port is allowed on which CLCIN */
	CLCIN0PPS = 0x10; /* RC0 PWM_OK */
	CLCIN1PPS = 0x11; /* RC1 PWM_OFF */
	CLCIN2PPS = 0x0c; /* RB4 BATT1_ON */
	CLCIN3PPS = 0x0d; /* RB5 BATT2_ON */
	CLCIN4PPS = 0x15; /* RC5 PWM_MID */

	/* setup CLC3 for BATT1_ON */
	CLCSELECT = 2;
	CLCnCON = 0x02; /* 4 input and */
	CLCnPOL = 0x0d; /* 2 noninverted; 1, 3 & 4 inverted */
	CLCnSEL0 = 0; /* CLCIN0PPS = PWM_OK */
	CLCnSEL1 = 1; /* CLCIN1PPS = PWM_OFF */
	CLCnSEL2 = 3; /* CLCIN3PPS = BATT2_ON */
	CLCnSEL3 = 4; /* CLCIN4PPS = PWM_MID */

	CLCnGLS0 = 0x69; /* b01101001 (!PWM_MID|BATT2_ON|PWM_OFF|!PWM_OK) */
	CLCnGLS1 = 0;
	CLCnGLS2 = 0;
	CLCnGLS3 = 0;
	CLCnCONbits.EN = 1;
	RB4PPS = 0x03; /* BATT1_ON = CLC3OUT */

	/* setup CLC4 for BATT2_ON */
	CLCSELECT = 3;
	CLCnCON = 0x02; /* 4 input and */
	CLCnPOL = 0x0d; /* 2 noninverted; 1, 3 & 4 inverted */
	CLCnSEL0 = 0; /* CLCIN0PPS = PWM_OK */
	CLCnSEL1 = 1; /* CLCIN1PPS = PWM_OFF */
	CLCnSEL2 = 2; /* CLCIN2PPS = BATT1_ON */
	CLCnSEL3 = 4; /* CLCIN4PPS = PWM_MID */

	CLCnGLS0 = 0x69; /* b01101001 (!PWM_MID|BATT1_ON|PWM_OFF|!PWM_OK) */
	CLCnGLS1 = 0;
	CLCnGLS2 = 0;
	CLCnGLS3 = 0;
	CLCnCONbits.EN = 1;
	RB5PPS = 0x04; /* BATT2_ON = CLC4OUT */

	/* setup CM1 for PWM output voltage alarm */
	CM1CON0 = 0x02; /* hysteresis */
	CM1CON1 = 0x02; /* interrupt rising edge */
	CM1NCH = 0x00; /* CH1IN0- = RA0 */
	CM1PCH = 0x01; /* CH1IN1+ = vref */
	// CM1CON0bits.EN = 1;
	PIR1bits.C1IF = 0; /* clear any pending interrupt */
	PIE1bits.C1IE = 1; /* enable */

	/* setup PWM */
	OSCFRQ = 0x08; /* HFINTOSC at 64Mhz */
	PWM1ERS = 0; /* no external reset */
	PWM1LDS = 0; /* no autoload */
	PWM1CLK = 0x03; /* use HFINTOSSC: minimum off time = 32 */
	PWM1CPRE = 0; /* no prescale */
	PWM1PR = 512; /* pwm at 125Khz */
	PWM1GIE = 0;
	PWM1CON = 0; /* no enable yet */
	PWM1S1CFG = 0; /* left-aligned mode */
	PWM1S1P1 = 0; /* default to off */
	PWM1S1P2 = 0;
	RC6PPS = 0x18; /* PWM1S1P1_OUT */

	pwm_fsm = PWMF_DOWN;
	pwm_events.byte = 0;

	oled_col = 20;
	oled_line = 5;
	sprintf(oled_displaybuf, "hello");
	displaybuf_medium();
	oled_i2c_flush();

	for (c = 0; c < 4; c++) {
		oled_col = 20 * c;
		oled_line = 1;
		displaybuf_icon(c);
	}
	oled_i2c_flush();

	btn_state = BTN_IDLE;

	FVRCON = 0x8c; /* FVR on, CDAFVR 4.096v */

	/* CM2 for button interrupt */
	CM2CON0 = 0x42; /* invert polarity, hysteresis */
	CM2CON1 = 0x03; /* interrupt on both edges */
	CM2NCH = 0x01; /* CH1IN1- */
	CM2PCH = 0x06; /* FVR */
	CM2CON0bits.EN = 1;
	PIR14bits.C2IF = 0; /* clear any pending interrupt */
	PIE14bits.C2IE = 1; /* enable */

	/* wait 1s, clear display and start operations */
	for (c = 0; c < 100; c++) {
		t0 = timer0_read();
		while (timer0_read() - t0 < (TIMER0_1MS * 10)) {
			CLRWDT();
		}
	}

	/* clear display and put static infos */
	oled_s = oled_i2c_reset();
	memset(oled_s->oled_databuf, 0, OLED_I2C_DATABUFSZ);
	oled_s->oled_datalen = OLED_DISPLAY_SIZE;
	OLED_CTRL(oled_s, 0x00); OLED_CTRL(oled_s, 0x10);  /* reset column start */
	OLED_CTRL(oled_s, 0x21); OLED_CTRL(oled_s, 0); OLED_CTRL(oled_s, 0x7f); /*column start/end */
	OLED_CTRL(oled_s, 0xb0); /* page start */
	oled_s->oled_type = OLED_CTRL_CLEAR;
	oled_i2c_state = OLED_I2C_WAIT;
	oled_i2c_flush();

	oled_col = 0;
	oled_line = 0;
	displaybuf_icon(ICON_SUN);
	oled_i2c_flush();

	oled_col = 0;
	oled_line = 3;
	displaybuf_icon(ICON_LIGHT);
	oled_i2c_flush();

	oled_col = 0;
	oled_line = 6;
	displaybuf_icon(ICON_ENGINE);
	oled_i2c_flush();

	PIR2bits.ADCH3IF = 0;
	PIE2bits.ADCH3IE = 1;
	ADCTX = 0;
	ADCON0bits.CSEN = 1;
	ADCON0bits.GO = 1;

	printf("enter loop\n");

	while (1) {
		CLRWDT();
		if (C1INTLbits.RXIF) {
			nmea2000_receive();
		}
		if (NCANOK) {
			nmea2000_status = NMEA2000_S_ABORT;
			poll_count = timer0_read();;
		} else if (nmea2000_status != NMEA2000_S_OK) {
			uint16_t ticks, tmrv;

			tmrv = timer0_read();
			ticks = tmrv - poll_count;
			if (ticks > TIMER0_5MS) {
				poll_count = tmrv;
				nmea2000_poll(
				    (u_char)(ticks / TIMER0_1MS));
			}
			if (nmea2000_status == NMEA2000_S_OK) {
				printf("new addr %d\n", nmea2000_addr);
			}
		}

		pwm_runfsm();
		if (pwm_fsm == PWMF_IDLE) {
			PWM1PR = 512;
			PWM1S1P1 = 100;
			PWM1CONbits.LD = 1;
			pwm_fsm = PWMF_RUNNING;
			printf("PWM RUN CON 0x%x PR 0x%x P1 0x%x B 0x%x C 0x%x\n", 
			    PWM1CON,
			    PWM1PR,
			    PWM1S1P1,
			    PORTB,
			    PORTC);
			batt2_en(1);
		}

		PIE14bits.C2IE = 0;
		if (softintrs.bits.int_btn_down) {
			softintrs.bits.int_btn_down = 0;
			if (btn_state == BTN_IDLE) {
				btn_state = BTN_DOWN;
			}
		}
		if (softintrs.bits.int_btn_up) {
			switch(btn_state) {
			case BTN_DOWN_1_P:
			case BTN_DOWN_2_P:
				softintrs.bits.int_btn_up = 0;
				/* this is a up event */
				btn_state = BTN_UP;
				break;
			case BTN_DOWN:
			case BTN_DOWN_1:
			case BTN_DOWN_2:
				/* not ready for an UP event yet, wait */
				break;
			default:
				/* transient event */
				softintrs.bits.int_btn_up = 0;
				btn_state = BTN_IDLE;
				break;
			}
		}
		PIE14bits.C2IE = 1;

		if (softintrs.bits.int_adcc) {
			switch(ADCTX) {
			case 3:
				PIR2bits.ADCH4IF = 0;
				PIE2bits.ADCH4IE = 0;
				if (btn_state == BTN_DOWN) {
					if (ADRES > 0x600 && ADRES < 0x900) {
						btn_state = BTN_DOWN_2;
					} else if (ADRES > 0x400 &&
						   ADRES < 0x600) {
						btn_state = BTN_DOWN_1;
					} else {
						/* transient event */
						btn_state = BTN_IDLE;
					}
				} else {
					btn_state = BTN_IDLE;
				}
				break;
			default:
				PIR2bits.ADCH3IF = 0;
				ADCON0bits.CSEN = 0;
				/* save channel values */
				ADCTX = 0;
				ad_pwm = ADRES;
				ADCTX = 1;
				ad_solar = ADRES;
				ADCTX = 2;
				ad_temp = ADRES;
				break;
			}
			softintrs.bits.int_adcc = 0;
			if (btn_state != BTN_DOWN) {
				PIR2bits.ADCH3IF = 0;
				PIE2bits.ADCH3IE = 1;
				ADCTX = 0;
				ADCON0bits.CSEN = 1;
				ADCON0bits.GO = 1;
			}
		}

		switch (btn_state) {
		case BTN_DOWN:
			/* get btn value */
			if (!ADCON0bits.GO) {
				ADCON0bits.CSEN = 0;
				ADCTX = 3;
				PIR2bits.ADCH4IF = 0;
				PIE2bits.ADCH4IE = 1;
				ADCON0bits.GO = 1;
			}
			break;
		case BTN_DOWN_1:
			oled_col = 60;
			oled_line = 4;
			sprintf(oled_displaybuf, "  B1 ");
			displaybuf_small();
			printf("B1\n");
			pwm_events.bits.goon = 1;
			btn_state = BTN_DOWN_1_P;
			break;
		case BTN_DOWN_2:
			oled_col = 60;
			oled_line = 4;
			sprintf(oled_displaybuf, "  B2 ");
			displaybuf_small();
			printf("B2\n");
			btn_state = BTN_DOWN_2_P;
			break;
		case BTN_UP:
			oled_col = 60;
			oled_line = 4;
			sprintf(oled_displaybuf, "  up ");
			displaybuf_small();
			printf("up\n");
			btn_state = BTN_IDLE;
			pwm_events.bits.gooff = 1;
			break;
		default:
			break;
		}

