mbouyer/canbus_solar_mppt/software/pic18_mppt/main.c
		if (softintrs.bits.int_10hz) {
			softintrs.bits.int_10hz = 0;
			counter_1hz--;
			if (counter_1hz == 3) {
				adctotemp(0);
				oled_col = 60;
				oled_line = 1;
				sprintf(oled_displaybuf, "%4x", ad_pwm);
				displaybuf_small();
				oled_col = 60;
				oled_line = 2;
				sprintf(oled_displaybuf, "%4x", ad_solar);
				displaybuf_small();
				oled_col = 60;
				oled_line = 3;
				sprintf(oled_displaybuf, "%2.2fx", (float)board_temp / 100.0 - 273.15);
				displaybuf_small();
				oled_col = 60;
				oled_line = 5;
				sprintf(oled_displaybuf, "%4x", pwm_fsm);
				displaybuf_small();
			}
			if (counter_1hz == 2) {
				double amps;
				/* update display every seconds */
				/* solar */
				oled_col = 20;
				oled_line = 0;
				dislplay_battstat(2);
				/* batt1 (service) */
				oled_col = 20;
				oled_line = 3;
				dislplay_battstat(1);
				/* batt2 (engine) */
				oled_col = 20;
				oled_line = 6;
				dislplay_battstat(0);
			}

			if (counter_1hz == 1)
				pacops_pending.bits.refresh = 1;
			else if (counter_1hz & 1)
				pacops_pending.bits.refresh_v = 1;
			else
				pacops_pending.bits.read_values = 1;

			if (counter_1hz == 0) {
				counter_1hz = 10;
				pacops_pending.bits.read_accum = 1;
				seconds++;
				if (seconds == 600) {
					// USELOG update_log();
					seconds = 0;
				}
				// USEADC  ADCON0bits.ADON = 1; /* start a new cycle */
			}
			if (!NCANOK && nmea2000_status == NMEA2000_S_OK) {
				uint16_t ticks, tmrv;

				tmrv = timer0_read();
				ticks = tmrv - poll_count;
				if (ticks > TIMER0_5MS) {
					poll_count = tmrv;
					nmea2000_poll(
					   (u_char)(ticks / TIMER0_1MS));
				}
				if (nmea2000_status != NMEA2000_S_OK) {
					printf("lost CAN bus %d\n",
					    ticks);
				}
			}
		}
		if (softintrs.bits.int_pacacc) {
			int64_t acc_value;
			double v;
			char *acc_bytes = (void *)&acc_value;
			softintrs.bits.int_pacacc = 0;
			// printf("acc %ld", _read_accum.acc_count.acccnt_count);
			l600_current_count += _read_accum.acc_count.acccnt_count;
			for (c = 0; c < 3; c++) {
				acc_bytes[7] = 0;
				for (char b = 0; b < 7; b++) {
					acc_bytes[b] =
					    _read_accum.accum[c * 7 + b];
				}
				if (acc_value & 0x0080000000000000) {
					/* adjust negative value */
					acc_value |= 0xff00000000000000;
				}
				l600_current_acc[2 - c] += acc_value;
				/* batt_i = acc_value * 0.00075 * 100 */
				v = (double)acc_value * 0.075 / _read_accum.acc_count.acccnt_count;
		                // printf(" %4.4fA", v / 100);

			}
			// printf("\n");
				
			// printf("avg");
			for (c = 0; c < 3; c++) {
				/* i = acc_value * 0.00075 */
				/* batt_i = acc_value * 0.00075 * 100 */
				v = (double)_read_voltcur.batt_i[c] * 0.075;
				batt_i[2 - c] = (int16_t)(v + 0.5);
				// printf(" %4.4fA", v / 100);
				/* volt = vbus * 0.000488 */
				/* batt_v = vbus * 0.000488 * 100 */      
				v = (double)_read_voltcur.batt_v[c] * 0.0488;
				batt_v[2 - c] = (uint16_t)(v + 0.5);
				// printf(" %4.4fV", v / 100);
			}
			// printf("\n");
		}
		if (softintrs.bits.int_pacavg) {
			softintrs.bits.int_pacavg = 0;
		}
		pac_command_schedule();
		while (i2c_return != I2C_INPROGRESS) {
			if (pac_i2c_state < PAC_I2C_WAIT &&
			    oled_i2c_state < OLED_I2C_WAIT) {
				break;
			}

			/*
			 * pac has higher priority
			 */
			 switch(oled_i2c_state) {
			 case OLED_I2C_CMD:
			 case OLED_I2C_DATA:
				oled_i2c_exec();
				break;
			 case OLED_I2C_WAIT:
				if (pac_i2c_state < PAC_I2C_WAIT)
					oled_i2c_exec();
				break;
			default:
				break;
			}
			if (oled_i2c_state == OLED_I2C_ERROR) {
				if (!oled_error)
					printf("oled i2c error\n"); // XXX
				oled_error = 1;
				oled_i2c_state = OLED_I2C_IDLE;
				oled_i2c_buf[oled_i2c_cons].oled_type = OLED_CTRL_FREE;
			}
			 switch(pac_i2c_state) {
			 case PAC_I2C_READ:
			 case PAC_I2C_WRITE:
				pac_i2c_exec();
				break;
			 case PAC_I2C_WAIT:
				if (oled_i2c_state <= OLED_I2C_WAIT)
					pac_i2c_exec();
				break;
			default:
				break;
			}
			if (pac_i2c_state == PAC_I2C_ERROR) {
				printf("pac i2c error\n"); // XXX
				pac_i2c_state = PAC_I2C_IDLE;
				pac_i2c_io.pac_type = PAC_FREE;
			} else if (pac_i2c_state == PAC_I2C_COMPLETE) {
				pac_command_complete();
				pac_command_schedule();
			}
		}

		if (PIR4bits.U1RXIF && (U1RXB == 'r'))
			break;
		if (default_src != 0) {
			printf("default handler called for 0x%x\n",
			    default_src);
		}
	}
	while ((c = (char)getchar()) != 'r') {
		printf("resumed %u\n", timer0_read());
		goto again;
	}
	WDTCON0bits.SEN = 0;
	printf("returning\n");
	while (!PIR4bits.U1TXIF) {
		; /* wait */ 
	}
	RESET();
	return 0;
}

u_int
timer0_read(void)
{
	u_int value;

	/* timer0_value = TMR0L | (TMR0H << 8), reading TMR0L first */
	di();
	asm("movff TMR0L, timer0_read@value");
	asm("movff TMR0H, timer0_read@value+1");
	ei();
	return value;
}

#ifdef USE_TIMER2
void __interrupt(__irq(TMR2), __high_priority, base(IVECT_BASE))
irqh_timer2(void)
{
	PIR3bits.TMR2IF = 0;
	if (--counter_10hz == 0) {
		counter_10hz = 25;
		softintrs.bits.int_10hz = 1;
	}			
}
#else
void __interrupt(__irq(TU16A), __high_priority, base(IVECT_BASE))
irqh_tu16a(void)
{
	TU16ACON1bits.CLR = 1;
	TU16ACON1bits.PRIF = 0;
	softintrs.bits.int_10hz = 1;
}
#endif

void __interrupt(__irq(CM1), __low_priority, base(IVECT_BASE))
irqh_cm1(void)
{
	PIR1bits.C1IF = 0;
}

void __interrupt(__irq(CM2), __low_priority, base(IVECT_BASE))
irqh_cm2(void)
{
	if (CM2CON0bits.OUT)
		softintrs.bits.int_btn_down = 1;
	else 
		softintrs.bits.int_btn_up = 1;
	PIR14bits.C2IF = 0;
}

void __interrupt(__irq(ADCH3), __low_priority, base(IVECT_BASE))
irqh_adcc3(void)
{
	PIE2bits.ADCH3IE = 0;
	softintrs.bits.int_adcc = 1;
}

void __interrupt(__irq(ADCH4), __low_priority, base(IVECT_BASE))
irqh_adcc4(void)
{
	PIE2bits.ADCH4IE = 0;
	softintrs.bits.int_adcc = 1;
}

void __interrupt(__irq(default), __low_priority, base(IVECT_BASE))
irqh_default(void)
{
	default_src = 0xff;
}
